ehrenhasz/anvilos_alpha/oss_sovereignty/sources/sys_09_Anvil/source/ports/stm32/boards/NUCLEO_WB55/mpconfigboard.h


#define MICROPY_HW_BOARD_NAME       "NUCLEO-WB55"
#define MICROPY_HW_MCU_NAME         "STM32WB55RGV6"

#define MICROPY_PY_PYB_LEGACY       (0)

#define MICROPY_HW_HAS_FLASH        (1)
#define MICROPY_HW_ENABLE_RTC       (1)
#define MICROPY_HW_ENABLE_RNG       (1)
#define MICROPY_HW_ENABLE_USB       (1)
#define MICROPY_HW_HAS_SWITCH       (1)


#define RTC_ASYNCH_PREDIV           (0)
#define RTC_SYNCH_PREDIV            (0x7fff)
#define MICROPY_HW_RTC_USE_LSE      (1)
#define MICROPY_HW_RTC_USE_US       (1)


#define MICROPY_HW_UART1_TX         (pin_B6)
#define MICROPY_HW_UART1_RX         (pin_B7)
#define MICROPY_HW_LPUART1_TX       (pin_A2)
#define MICROPY_HW_LPUART1_RX       (pin_A3)

#define MICROPY_HW_UART_REPL        PYB_UART_1
#define MICROPY_HW_UART_REPL_BAUD   115200


#define MICROPY_HW_I2C1_SCL         (pin_B8)    
#define MICROPY_HW_I2C1_SDA         (pin_B9)    
#define MICROPY_HW_I2C3_SCL         (pin_C0)    
#define MICROPY_HW_I2C3_SDA         (pin_C1)    


#define MICROPY_HW_SPI1_NSS         (pin_A4)    
#define MICROPY_HW_SPI1_SCK         (pin_A5)    
#define MICROPY_HW_SPI1_MISO        (pin_A6)    
#define MICROPY_HW_SPI1_MOSI        (pin_A7)    
#define MICROPY_HW_SPI2_NSS         (pin_B12)   
#define MICROPY_HW_SPI2_SCK         (pin_B13)   
#define MICROPY_HW_SPI2_MISO        (pin_B14)   
#define MICROPY_HW_SPI2_MOSI        (pin_B15)   


#define MICROPY_HW_USRSW_PIN        (pin_C4)
#define MICROPY_HW_USRSW_PULL       (GPIO_PULLUP)
#define MICROPY_HW_USRSW_EXTI_MODE  (GPIO_MODE_IT_FALLING)
#define MICROPY_HW_USRSW_PRESSED    (0)


#define MICROPY_HW_LED1             (pin_B5) 
#define MICROPY_HW_LED2             (pin_B0) 
#define MICROPY_HW_LED3             (pin_B1) 
#define MICROPY_HW_LED_ON(pin)      (mp_hal_pin_high(pin))
#define MICROPY_HW_LED_OFF(pin)     (mp_hal_pin_low(pin))


#define MICROPY_HW_USB_FS           (1)
#define MICROPY_HW_USB_CDC_RX_DATA_SIZE (512)
#define MICROPY_HW_USB_CDC_TX_DATA_SIZE (512)


#define MICROPY_HW_BLE_UART_ID       (0)
#define MICROPY_HW_BLE_UART_BAUDRATE (115200)
